;------------ Encoding: UTF-16 ------------
;请对照 CapsLock+settingsDemo.ini 来配置相关设置
[Global]

loadScript=scriptDemo.js

;是否开机自启动，1为是，0为否（默认）。
autostart=1
mouseSpeed=3

[QSearch]

[QRun]

work=E:\work\00_开发工作
capslock=D:\安装包\Capslock+
sublime="C:\Program Files\Sublime Text 3\sublime_text.exe"
cmder="E:\cmder\Cmder.exe"

[QWeb]

andr=http://androidxref.com

[TabHotString]

[QStyle]

[TTranslate]

[Keys]

;光标向下移动
caps_j=keyFunc_moveDown

;光标向上移动
caps_k=keyFunc_moveUp

;光标向左移动
caps_h=keyFunc_moveLeft

;光标向右移动
caps_l=keyFunc_moveRight

;光标向上移动 5 行
caps_i=keyFunc_moveUp(10)

;Capslock+d -> 光标向下移动 5 行
caps_m=keyFunc_moveDown(10)

;Capslock+f -> 向上翻页
caps_u=keyFunc_pageUp

;Capslock+b -> 向下翻页
caps_n=keyFunc_pageDown

;向上选中
caps_e=keyFunc_selectUp

;向左选中
caps_s=keyFunc_selectLeft

;向下选中
caps_d=keyFunc_selectDown

;向右选中
caps_f=keyFunc_selectRight
